In [1]:
''' 
PassengerId	승객 번호	문자형
Survived	생존여부(1: 생존, 0 : 사망)	범주형(이진)
Pclass	승선권 클래스(1 : 1st, 2 : 2nd ,3 : 3rd)	범주형
Name	승객 이름	문자형
Sex	승객 성별	범주형(이진, 남자 or 여자)
Age	승객 나이	연속형
SibSp	동반한 형제자매, 배우자 수	연속형
Parch	동반한 부모, 자식 수	연속형
Ticket	티켓의 고유 넘버	문자형
Fare	티켓의 요금	연속형
Cabin	객실 번호	문자형
Embarked	승선한 항구명(C : Cherbourg, Q : Queenstown, S : Southampton)	범주형

“what sorts of people were more likely to survive?” 
using passenger data (ie name, age, gender, socio-economic class, etc).
'''

' \nPassengerId\t승객 번호\t문자형\nSurvived\t생존여부(1: 생존, 0 : 사망)\t범주형(이진)\nPclass\t승선권 클래스(1 : 1st, 2 : 2nd ,3 : 3rd)\t범주형\nName\t승객 이름\t문자형\nSex\t승객 성별\t범주형(이진, 남자 or 여자)\nAge\t승객 나이\t연속형\nSibSp\t동반한 형제자매, 배우자 수\t연속형\nParch\t동반한 부모, 자식 수\t연속형\nTicket\t티켓의 고유 넘버\t문자형\nFare\t티켓의 요금\t연속형\nCabin\t객실 번호\t문자형\nEmbarked\t승선한 항구명(C : Cherbourg, Q : Queenstown, S : Southampton)\t범주형\n\n“what sorts of people were more likely to survive?” \nusing passenger data (ie name, age, gender, socio-economic class, etc).\n'

In [2]:
'''데이터 전처리 >> 중요변수 선택 및 변수추출 >> 학습 >> 예측 >> 정확도 >> TEST셋 '''

'데이터 전처리 >> 중요변수 선택 및 변수추출 >> 학습 >> 예측 >> 정확도 >> TEST셋 '

In [1]:
pip install numpy

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: numpy in /Users/gim-yongmin/Library/Python/3.7/lib/python/site-packages (1.21.0)
Note: you may need to restart the kernel to use updated packages.

In [13]:
pip install --upgrade pip --user

Requirement already satisfied: pip in /Users/gim-yongmin/Library/Python/3.7/lib/python/site-packages (21.1.3)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import numpy as np
import pandas as pd

In [3]:
titanic = pd.read_csv("train.csv")

In [4]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [5]:
titanic = titanic.drop(['PassengerId', 'Name', 'Ticket','Cabin'], axis = 1) # id, date, zipcode, lat, long  제거

In [248]:
titanic
#titanic[['Survived','Pclass']]

     Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0           0       3    male  22.0      1      0   7.2500        S
1           1       1  female  38.0      1      0  71.2833        C
2           1       3  female  26.0      0      0   7.9250        S
3           1       1  female  35.0      1      0  53.1000        S
4           0       3    male  35.0      0      0   8.0500        S
..        ...     ...     ...   ...    ...    ...      ...      ...
886         0       2    male  27.0      0      0  13.0000        S
887         1       1  female  19.0      0      0  30.0000        S
888         0       3  female   NaN      1      2  23.4500        S
889         1       1    male  26.0      0      0  30.0000        C
890         0       3    male  32.0      0      0   7.7500        Q

[891 rows x 8 columns]

In [249]:
#type(titanic)
titanic.describe()
#AGE는 변환해야될 것임

         Survived      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [250]:
print(titanic.isnull().sum(axis=0))

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Embarked      2
dtype: int64

In [127]:
type(titanic['Age'].min())

float

In [103]:
titanic.groupby(['Pclass','Sex','SibSp','Parch'])['Age'].count()

titanic.groupby(['Sex','Survived','Pclass'])['Age'].median()

Pclass  Sex     SibSp  Parch
1       female  0      0        32
                       1         9
                       2         5
                1      0        23
                       1         7
                                ..
3       male    3      2         2
                4      1         9
                       2         3
                5      2         4
                8      2         0
Name: Age, Length: 74, dtype: int64

In [214]:
titanic.groupby(['Sex','Survived','Pclass'])["Age"].transform("median")

0      27.0
1      35.0
2      22.0
3      35.0
4      27.0
       ...
886    30.0
887    35.0
888    22.0
889    36.0
890    27.0
Name: Age, Length: 891, dtype: float64

In [251]:
titanic["Age"].fillna(
    titanic.groupby(['Sex','Survived','Pclass'])["Age"].transform("median"), inplace=True)

In [252]:
titanic["Age"]=titanic["Age"].astype(int)

In [216]:
# ktitanic.where(titanic['Survived'] ==0)

# survived_0 = titanic['Survived'] ==0
# pclass_3=titanic['Pclass'] ==3
# sibsp_1=titanic['SibSp'] ==1
# parch_2=titanic['Parch'] ==2

# titanic[survived_0 & pclass_3 & sibsp_1 &parch_2 ]

In [253]:
titanic.describe()

         Survived      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  891.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.042649    0.523008    0.381594   32.204208
std      0.486592    0.836071   13.485505    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.000000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   21.000000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   26.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   36.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [254]:
titanic['Age'].describe()

count    891.000000
mean      29.042649
std       13.485505
min        0.000000
25%       21.000000
50%       26.000000
75%       36.000000
max       80.000000
Name: Age, dtype: float64

#### 0세~16세 >> 0
#### 17세~29세 >> 1
#### 30세~43세 >> 2
#### 30세~39세 >> 3
#### 40세~49세 >> 4
#### 50세~59세 >> 5
#### 60세~ >> 6 로 라벨링

In [42]:
titanic_test = pd.read_csv("test.csv")